[
  {
    "id": 1,
    "receita": "Frango Agridoce",
    "ingredientes": "500g de peito de frango cortado em cubos, 1 pimentão vermelho cortado em pedaços, 1 pimentão verde cortado em pedaços, 1 cebola cortada em pedaços, 1 cenoura cortada em rodelas finas, 1/2 abacaxi cortado em cubos, 4 colheres de sopa de molho de soja, 2 colheres de sopa de vinagre de arroz, 2 colheres de sopa de açúcar mascavo, 1 colher de sopa de amido de milho, Sal e pimenta a gosto, Óleo de gergelim para finalizar",
    "modo_preparo": "1- Em uma tigela, misture o molho de soja, o vinagre de arroz, o açúcar mascavo, o amido de milho, o sal e a pimenta. Reserve. 2- Aqueça um pouco de óleo em uma frigideira grande ou wok em fogo médio-alto. 3- Adicione o frango e cozinhe até dourar. Remova o frango da frigideira e reserve. 4- Na mesma frigideira, adicione um pouco mais de óleo, se necessário, e refogue os pimentões, a cebola e a cenoura até ficarem macios. 5- Retorne o frango à frigideira e adicione o molho reservado. Cozinhe por alguns minutos até o molho engrossar e o frango estar completamente cozido. 6- Adicione o abacaxi e cozinhe por mais alguns minutos. 7- Finalize com um fio de óleo de gergelim. 8- Sirva o frango agridoce acompanhado de arroz branco.",
    "link_imagem": "https://www.seriouseats.com/thmb/s1TV4SMRoF0pMJd3Dm3F6ed_p_c=/1500x1125/smart/filters:no_upscale()/20200528-sweet-and-sour-chicken-vicky-wasik-22-1468a6e4b81c4678b16d6a71c00b1f3a.jpg",
    "tipo": "Agridoces",
    "created_at": "2023-12-31T01:54:02.909Z",
    "IngredientesBase": [
      {
        "id": 1,
        "nomesIngrediente": [
          "peito de frango",
          "pimentão vermelho",
          "pimentão verde",
          "cebola",
          "cenoura",
          "abacaxi",
          "molho de soja",
          "vinagre de arroz",
          "açúcar mascavo",
          "amido de milho",
          "sal",
          "pimenta",
          "óleo de gergelim"
        ],
        "receita_id": 1,
        "created_at": "2023-12-31T01:54:02.909Z"
      }
    ]
  },

  {
    "id": 2,
    "receita": "Porco Agridoce",
    "ingredientes": "500g de carne de porco cortada em cubos, 1 pimentão amarelo cortado em pedaços, 1 pimentão verde cortado em pedaços, 1 cebola cortada em pedaços, 1 abacaxi cortado em cubos, 4 colheres de sopa de molho de soja, 3 colheres de sopa de vinagre de arroz, 2 colheres de sopa de ketchup, 3 colheres de sopa de açúcar mascavo, 1 colher de sopa de amido de milho, Sal e pimenta a gosto, Óleo de gergelim para finalizar",
    "modo_preparo": "1- Em uma tigela, misture o molho de soja, o vinagre de arroz, o ketchup, o açúcar mascavo, o amido de milho, o sal e a pimenta. Reserve. 2- Aqueça um pouco de óleo em uma panela grande ou wok em fogo médio-alto. 3- Adicione a carne de porco e cozinhe até dourar. Remova a carne de porco da panela e reserve. 4- Na mesma panela, adicione um pouco mais de óleo, se necessário, e refogue os pimentões e a cebola até ficarem macios. 5- Retorne a carne de porco à panela e adicione o abacaxi e o molho reservado. Cozinhe por alguns minutos até o molho engrossar e a carne estar completamente cozida. 6- Finalize com um fio de óleo de gergelim. 7- Sirva o porco agridoce acompanhado de arroz branco.",
    "link_imagem": "https://www.recipetineats.com/wp-content/uploads/2020/02/Chinese-Pork-Stir-Fry_5.jpg",
    "tipo": "agridoce",
    "created_at": "2023-12-31T01:54:02.909Z",
    "IngredientesBase": [
      {
        "id": 2,
        "nomesIngrediente": [
          "carne de porco",
          "pimentão amarelo",
          "pimentão verde",
          "cebola",
          "abacaxi",
          "molho de soja",
          "vinagre de arroz",
          "ketchup",
          "açúcar mascavo",
          "amido de milho",
          "sal",
          "pimenta",
          "óleo de gergelim"
        ],
        "receita_id": 2,
        "created_at": "2023-12-31T01:54:02.909Z"
      }
    ]
  },
  {
    "id": 3,
    "receita": "Camarão Agridoce",
    "ingredientes": "500g de camarão descascado, 1 pimentão vermelho cortado em pedaços, 1 pimentão amarelo cortado em pedaços, 1 cebola cortada em pedaços, 1 abacaxi cortado em cubos, 4 colheres de sopa de molho de soja, 3 colheres de sopa de vinagre de arroz, 2 colheres de sopa de mel, 1 colher de sopa de molho de pimenta agridoce, Sal e pimenta a gosto, Óleo de gergelim para finalizar",
    "modo_preparo": "1- Em uma tigela, misture o molho de soja, o vinagre de arroz, o mel, o molho de pimenta agridoce, o sal e a pimenta- Reserve- 2- Aqueça um pouco de óleo em uma frigideira grande ou wok em fogo médio-alto- 3- Adicione os camarões e cozinhe até ficarem rosados- Remova os camarões da frigideira e reserve- 4- Na mesma frigideira, adicione um pouco mais de óleo, se necessário, e refogue os pimentões e a cebola até ficarem macios- 5- Retorne os camarões à frigideira e adicione o abacaxi e o molho reservado- Cozinhe por alguns minutos até o molho engrossar e os camarões estarem completamente cozidos- 6- Finalize com um fio de óleo de gergelim- 7- Sirva o camarão agridoce acompanhado de arroz branco-",
    "link_imagem": "https://www.simplyrecipes.com/thmb/Me9Z0-NKx7QBoDpx66XDB9IHM3g=/2000x1333/smart/filters:no_upscale()/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2008__03__sweet-sour-shrimp-vertical-5e71f5d330dc4c8d88cf094242f9e6f9.jpg",
    "tipo": "agridoce",
    "created_at": "2023-12-31T01:54:02.909Z",
    "IngredientesBase": [
      {
        "id": 3,
        "nomesIngrediente": [
          "camarão",
          "pimentão vermelho",
          "pimentão amarelo",
          "cebola",
          "abacaxi",
          "molho de soja",
          "vinagre de arroz",
          "mel",
          "molho de pimenta agridoce",
          "sal",
          "pimenta",
          "óleo de gergelim"
        ],
        "receita_id": 3,
        "created_at": "2023-12-31T01:54:02.909Z"
      }
    ]
  },
    {
      "id": 4,
      "receita": "Salmão Agridoce",
      "ingredientes": "4 filés de salmão, 1/2 xícara de molho de soja, 2 colheres de sopa de mel, 2 colheres de sopa de suco de limão, 2 colheres de sopa de óleo de gergelim, 2 colheres de chá de gengibre fresco ralado, 2 dentes de alho picados, Sal e pimenta a gosto",
      "modo_preparo": "1- Em uma tigela, misture o molho de soja, o mel, o suco de limão, o óleo de gergelim, o gengibre e o alho- Reserve- 2- Tempere os filés de salmão com sal e pimenta- 3- Em uma frigideira grande, grelhe os filés de salmão até que estejam cozidos por dentro- 4- Adicione o molho reservado à frigideira e deixe ferver por alguns minutos até engrossar levemente- 5- Sirva o salmão regado com o molho agridoce por cima-",      "link_imagem": "https://www.jessicagavin.com/wp-content/uploads/2019/02/sweet-and-spicy-salmon-6-1200.jpg",
      "tipo": "agridoce",
      "created_at": "2023-12-31T01:54:02.909Z",
      "IngredientesBase": [
        {
          "id": 4,
          "nomesIngrediente": [
            "filés de salmão",
            "molho de soja",
            "mel",
            "suco de limão",
            "óleo de gergelim",
            "gengibre fresco",
            "alho",
            "sal",
            "pimenta"
          ],
          "receita_id": 4,
          "created_at": "2023-12-31T01:54:02.909Z"
        }
      ]
    },
  {
    "id": 5,
    "receita": "Tofu Agridoce",
    "ingredientes": "500g de tofu firme, cortado em cubos, 1 pimentão vermelho cortado em pedaços, 1 pimentão verde cortado em pedaços, 1 cebola cortada em pedaços, 1 cenoura cortada em rodelas finas, 1/2 abacaxi cortado em cubos, 4 colheres de sopa de molho de soja, 3 colheres de sopa de vinagre de arroz, 2 colheres de sopa de açúcar mascavo, 1 colher de sopa de amido de milho, Sal e pimenta a gosto, Óleo de gergelim para finalizar",
    "modo_preparo": "1- Em uma tigela, misture o molho de soja, o vinagre de arroz, o açúcar mascavo, o amido de milho, o sal e a pimenta- Reserve- 2- Aqueça um pouco de óleo em uma frigideira grande ou wok em fogo médio-alto- 3- Adicione o tofu e cozinhe até dourar- Remova o tofu da frigideira e reserve- 4- Na mesma frigideira, adicione um pouco mais de óleo, se necessário, e refogue os pimentões, a cebola e a cenoura até ficarem macios- 5- Retorne o tofu à frigideira e adicione o abacaxi e o molho reservado- Cozinhe por alguns minutos até o molho engrossar e o tofu estar completamente aquecido- 6- Finalize com um fio de óleo de gergelim- 7- Sirva o tofu agridoce acompanhado de arroz branco-",    "link_imagem": "https://www.cilantroandcitronella.com/wp-content/uploads/2018/05/vegan-sweet-and-sour-tofu-bowl-2.jpg",
    "tipo": "agridoce",
    "created_at": "2023-12-31T01:54:02.909Z",
    "IngredientesBase": [
      {
        "id": 5,
        "nomesIngrediente": [
          "tofu firme",
          "pimentão vermelho",
          "pimentão verde",
          "cebola",
          "cenoura",
          "abacaxi",
          "molho de soja",
          "vinagre de arroz",
          "açúcar mascavo",
          "amido de milho",
          "sal",
          "pimenta",
          "óleo de gergelim"
        ],
        "receita_id": 5,
        "created_at": "2023-12-31T01:54:02.909Z"
      }
    ]
  },
  {
    "id": 6,
    "receita": "Queijo Coalho Grelhado com Molho de Mel",
    "ingredientes": "4 espetos de queijo coalho, 4 colheres de sopa de mel, 2 colheres de sopa de suco de limão, 1 colher de chá de pimenta vermelha picada (opcional), Sal a gosto",
    "modo_preparo": "1- Pré-aqueça uma grelha em fogo médio-alto- 2- Espete os pedaços de queijo coalho nos espetos- 3- Em uma tigela pequena, misture o mel, o suco de limão e a pimenta vermelha picada, se estiver usando- 4- Grelhe os espetos de queijo coalho na grelha pré-aquecida, virando ocasionalmente, até que estejam dourados e levemente crocantes por fora- 5- Retire os espetos da grelha e coloque em um prato- 6- Regue o queijo coalho grelhado com o molho de mel- 7- Tempere com sal a gosto- 8- Sirva imediatamente enquanto ainda está quente-",    "link_imagem": "https://www.seriouseats.com/thmb/QdPysq67yZGL7z4to6W8M2IqLsU=/1500x1125/smart/filters:no_upscale()/20200813-grilled-halloumi-vicky-wasik-15-35a66c4cf98a41bb8ec2cc7e56985c8c.jpg",
    "tipo": "agridoce",
    "created_at": "2023-12-31T01:54:02.909Z",
    "IngredientesBase": [
      {
        "id": 6,
        "nomesIngrediente": [
          "queijo coalho",
          "mel",
          "suco de limão",
          "pimenta vermelha",
          "sal"
        ],
        "receita_id": 6,
        "created_at": "2023-12-31T01:54:02.909Z"
      }
    ]
  },
  {
    "id": 7,
    "receita": "Panqueca de Frango Agridoce",
    "ingredientes": "Para a massa da panqueca: 1 xícara de farinha de trigo, 1 xícara de leite, 1 ovo, 1 colher de sopa de óleo, 1 pitada de sal; Para o recheio de frango agridoce: 300g de peito de frango cozido e desfiado, 1 cebola cortada em pedaços, 1 pimentão vermelho cortado em pedaços, 1/2 abacaxi cortado em cubos, 4 colheres de sopa de molho de soja, 3 colheres de sopa de vinagre de arroz, 2 colheres de sopa de açúcar mascavo, 1 colher de sopa de amido de milho, Sal e pimenta a gosto, Óleo de gergelim para refogar",
    "modo_preparo": "1- Prepare a massa da panqueca: Em uma tigela, misture a farinha de trigo, o leite, o ovo, o óleo e o sal até obter uma massa homogênea- Aqueça uma frigideira antiaderente untada com um pouco de óleo e despeje uma concha de massa, espalhando bem para cobrir o fundo da frigideira- Cozinhe por cerca de 1 minuto de cada lado, ou até dourar levemente- Repita o processo até acabar a massa- Reserve as panquecas- 2- Prepare o recheio de frango agridoce: Em uma frigideira grande ou wok, aqueça um pouco de óleo em fogo médio-alto- Adicione a cebola e o pimentão e refogue até ficarem macios- Acrescente o frango desfiado e o abacaxi, mexendo bem- 3- Em uma tigela pequena, misture o molho de soja, o vinagre de arroz, o açúcar mascavo e o amido de milho- Despeje sobre a mistura de frango na frigideira e mexa continuamente até engrossar e o frango estiver bem revestido com o molho- Tempere com sal e pimenta a gosto- 4- Recheie cada panqueca com o frango agridoce preparado, dobre ou enrole e sirva quente-",    "link_imagem": "https://www.seriouseats.com/thmb/9_7HIBxJZ7uv3Bp9HibtnUqssq4=/1500x1125/smart/filters:no_upscale()/20200901-sweet-sour-chicken-pancakes-vicky-wasik-1-95f71df6004341f0842cb2b7d5f1ec96.jpg",
    "tipo": "agridoce",
    "created_at": "2023-12-31T01:54:02.909Z",
    "IngredientesBase": [
      {
        "id": 7,
        "nomesIngrediente": [
          "farinha de trigo",
          "leite",
          "ovo",
          "óleo",
          "sal",
          "peito de frango",
          "cebola",
          "pimentão vermelho",
          "abacaxi",
          "molho de soja",
          "vinagre de arroz",
          "açúcar mascavo",
          "amido de milho",
          "sal",
          "pimenta",
          "óleo de gergelim"
        ],
        "receita_id": 7,
        "created_at": "2023-12-31T01:54:02.909Z"
      }
    ]
  }
]